import jieba
excludes = {"两个","一个","只见","如何","那里","军马","如此","头领","说道","众人"\
            ,"这里","出来","小人","今日","这个","先锋","好汉","哥哥","兄弟","梁山泊"\
            ,"便是","妇人","人马","起来","问道","因此","不得","三个","我们","次日"\
            ,"只是","不曾","不知","不是","一面","且说","来到","不敢","却是","看时"\
            ,"将军","如今","原来","山寨","正是","喝道","只得","一齐","兄长","当下"\
            ,"知府","大喜","里面","军士","商议","小弟","天子","性命","前面","城中"\
            ,"将来","公人","东京","不要","不见","那个","上山","下山","喽罗","一声"\
            ,"怎地","弟兄","随即","一条","只顾","收拾","甚么","四个","许多","答道"\
            ,"庄客","起身","听得","银子","下来","慌忙","众将","回来","你们","认得"\
            ,"当日","朝廷","酒家","却说","向前","前来","看见","兵马","那汉","太尉"\
            ,"安排","朴刀","心中","当时","明日","到来","二人","相见","不肯","分付"\
            ,"正在","下马","这般","寻思","有些","几个","和尚","娘子","酒店","庄上"\
            ,"马上","两边","那厮","上马","不能","不可","一般","自去","不在话下","房里"\
            ,"相公","客人","酒保","取出","有人","一日","必然","家里","乃是","路上","太公"\
            ,"阵前","去处","口里","大官人","左右","师父","水军","坐下","大汉","23"\
            ,"回到","不想","迎接","报知","城池","一处","此间"}
txt = open("shuihu.txt", "r", encoding='utf-8').read()
words  = jieba.lcut(txt)
counts = {}
for word in words:
    if len(word) == 1:
        continue
    elif word =="宋江道" or word=="宋公明":
        rword = "宋江"
    elif word == "呼延":
        rword = "呼延灼"
    elif word =="智深":
        rword = "鲁智深"
    elif word == "军师" or word=="学究":
        rword = "吴用"
    elif word =="高太尉":
        rword ="高俅"
    elif word =="武大":
        rword ="武大郎"
    else:
        rword = word
    counts[rword] = counts.get(rword,0) + 1
for word in excludes:
    del counts[word]
items = list(counts.items())
items.sort(key=lambda x:x[1], reverse=True) 
for i in range(39):
    word, count = items[i]
    print ("{0:<10}{1:>5}".format(word, count))
